{
  "[ADMIRATION]": 49152,
  "[AMUSEMENT]": 49153,
  "[ANGER]": 49154,
  "[ANNOYANCE]": 49155,
  "[APPROVAL]": 49156,
  "[CARING]": 49157,
  "[CONFUSION]": 49158,
  "[CURIOUSITY]": 49159,
  "[DESIRE]": 49160,
  "[DISAPPOINTMENT]": 49161,
  "[DISAPPROVAL]": 49162,
  "[DISGUST]": 49163,
  "[EMBARRASSMENT]": 49164,
  "[EXCITEMENT]": 49165,
  "[FEAR]": 49166,
  "[GRATITUDE]": 49167,
  "[GRIEF]": 49168,
  "[JOY]": 49169,
  "[LOVE]": 49170,
  "[NERVOUSNESS]": 49171,
  "[NEUTRAL]": 49179,
  "[OPTIMISM]": 49172,
  "[PRIDE]": 49173,
  "[REALIZATION]": 49174,
  "[RELIEF]": 49175,
  "[REMORSE]": 49176,
  "[SADNESS]": 49177,
  "[SURPRISE]": 49178
}
